cmd/why/testdata/TestWhyCommand_MermaidFormat_Golden.gold.mermaid
flowchart LR
  subgraph sg_caller_0["source_test.go"]
    caller_0_0["TestX()"]
  end
  subgraph sg_callee_0["target.go"]
    m_ParseSwiftImports_0_0["ParseSwiftImports()"]
    m_Resolve_0_1["(*Graph).Resolve()"]
  end
  caller_0_0 -->|"L3 (calls func)"| m_ParseSwiftImports_0_0
  caller_0_0 -->|"L5 (calls method *Graph)"| m_Resolve_0_1
